; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=396, out_folder=htg/blocksworld/training, instance_id=92, seed=2116, goal_proportion=0.03

(define (problem blocksworld-92)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 - object)
 (:init 
    (arm-empty)
    (clear b327)
    (on b327 b222)
    (on b222 b103)
    (on b103 b364)
    (on b364 b236)
    (on-table b236)
    (clear b53)
    (on-table b53)
    (clear b371)
    (on b371 b181)
    (on b181 b21)
    (on b21 b55)
    (on b55 b275)
    (on b275 b338)
    (on-table b338)
    (clear b56)
    (on b56 b37)
    (on b37 b93)
    (on-table b93)
    (clear b239)
    (on b239 b393)
    (on b393 b269)
    (on b269 b349)
    (on b349 b142)
    (on b142 b260)
    (on b260 b370)
    (on b370 b154)
    (on b154 b147)
    (on b147 b368)
    (on-table b368)
    (clear b87)
    (on b87 b334)
    (on b334 b306)
    (on b306 b195)
    (on-table b195)
    (clear b288)
    (on-table b288)
    (clear b206)
    (on b206 b227)
    (on-table b227)
    (clear b218)
    (on b218 b3)
    (on b3 b277)
    (on b277 b143)
    (on b143 b231)
    (on b231 b175)
    (on b175 b346)
    (on b346 b344)
    (on-table b344)
    (clear b375)
    (on-table b375)
    (clear b363)
    (on b363 b149)
    (on b149 b193)
    (on b193 b243)
    (on b243 b170)
    (on-table b170)
    (clear b249)
    (on b249 b57)
    (on b57 b140)
    (on b140 b65)
    (on-table b65)
    (clear b99)
    (on b99 b355)
    (on b355 b51)
    (on b51 b296)
    (on b296 b180)
    (on b180 b357)
    (on b357 b369)
    (on b369 b156)
    (on-table b156)
    (clear b372)
    (on-table b372)
    (clear b94)
    (on-table b94)
    (clear b194)
    (on b194 b58)
    (on b58 b389)
    (on-table b389)
    (clear b117)
    (on b117 b266)
    (on-table b266)
    (clear b383)
    (on b383 b61)
    (on b61 b139)
    (on-table b139)
    (clear b22)
    (on b22 b7)
    (on b7 b177)
    (on b177 b166)
    (on b166 b201)
    (on b201 b119)
    (on-table b119)
    (clear b19)
    (on b19 b318)
    (on b318 b62)
    (on b62 b205)
    (on b205 b279)
    (on b279 b285)
    (on b285 b270)
    (on b270 b316)
    (on b316 b343)
    (on b343 b282)
    (on b282 b18)
    (on b18 b122)
    (on-table b122)
    (clear b298)
    (on b298 b278)
    (on b278 b9)
    (on b9 b132)
    (on b132 b30)
    (on b30 b70)
    (on b70 b84)
    (on b84 b128)
    (on b128 b385)
    (on-table b385)
    (clear b145)
    (on-table b145)
    (clear b33)
    (on b33 b64)
    (on-table b64)
    (clear b387)
    (on b387 b340)
    (on b340 b320)
    (on b320 b74)
    (on b74 b313)
    (on b313 b354)
    (on b354 b112)
    (on-table b112)
    (clear b273)
    (on b273 b121)
    (on b121 b16)
    (on b16 b12)
    (on-table b12)
    (clear b5)
    (on b5 b378)
    (on b378 b337)
    (on b337 b221)
    (on b221 b358)
    (on b358 b245)
    (on b245 b366)
    (on-table b366)
    (clear b220)
    (on b220 b68)
    (on b68 b116)
    (on b116 b11)
    (on b11 b173)
    (on b173 b209)
    (on b209 b168)
    (on b168 b247)
    (on b247 b204)
    (on-table b204)
    (clear b303)
    (on-table b303)
    (clear b226)
    (on-table b226)
    (clear b198)
    (on b198 b225)
    (on b225 b47)
    (on b47 b300)
    (on b300 b257)
    (on b257 b284)
    (on b284 b386)
    (on b386 b394)
    (on b394 b192)
    (on b192 b110)
    (on-table b110)
    (clear b297)
    (on b297 b66)
    (on b66 b388)
    (on b388 b23)
    (on b23 b118)
    (on b118 b200)
    (on b200 b326)
    (on-table b326)
    (clear b60)
    (on-table b60)
    (clear b6)
    (on-table b6)
    (clear b215)
    (on-table b215)
    (clear b345)
    (on b345 b138)
    (on-table b138)
    (clear b235)
    (on b235 b321)
    (on b321 b272)
    (on b272 b155)
    (on b155 b347)
    (on-table b347)
    (clear b230)
    (on b230 b381)
    (on-table b381)
    (clear b259)
    (on b259 b124)
    (on-table b124)
    (clear b314)
    (on b314 b59)
    (on-table b59)
    (clear b167)
    (on b167 b113)
    (on b113 b373)
    (on b373 b292)
    (on b292 b361)
    (on b361 b151)
    (on b151 b127)
    (on b127 b203)
    (on b203 b10)
    (on-table b10)
    (clear b32)
    (on b32 b261)
    (on b261 b13)
    (on b13 b8)
    (on-table b8)
    (clear b54)
    (on b54 b238)
    (on-table b238)
    (clear b83)
    (on b83 b241)
    (on b241 b262)
    (on b262 b172)
    (on-table b172)
    (clear b356)
    (on-table b356)
    (clear b307)
    (on b307 b234)
    (on b234 b174)
    (on b174 b255)
    (on b255 b120)
    (on-table b120)
    (clear b242)
    (on-table b242)
    (clear b45)
    (on b45 b90)
    (on b90 b146)
    (on b146 b189)
    (on-table b189)
    (clear b25)
    (on b25 b161)
    (on-table b161)
    (clear b302)
    (on b302 b135)
    (on b135 b324)
    (on-table b324)
    (clear b246)
    (on-table b246)
    (clear b310)
    (on b310 b35)
    (on-table b35)
    (clear b202)
    (on b202 b223)
    (on b223 b4)
    (on-table b4)
    (clear b104)
    (on-table b104)
    (clear b290)
    (on b290 b165)
    (on b165 b164)
    (on-table b164)
    (clear b224)
    (on b224 b286)
    (on b286 b319)
    (on-table b319)
    (clear b152)
    (on-table b152)
    (clear b80)
    (on b80 b34)
    (on b34 b97)
    (on b97 b1)
    (on b1 b251)
    (on b251 b17)
    (on b17 b185)
    (on b185 b212)
    (on-table b212)
    (clear b42)
    (on b42 b380)
    (on b380 b256)
    (on b256 b268)
    (on b268 b382)
    (on-table b382)
    (clear b131)
    (on b131 b332)
    (on b332 b186)
    (on b186 b148)
    (on b148 b208)
    (on-table b208)
    (clear b248)
    (on b248 b76)
    (on b76 b130)
    (on-table b130)
    (clear b191)
    (on b191 b379)
    (on b379 b49)
    (on-table b49)
    (clear b217)
    (on b217 b67)
    (on b67 b43)
    (on b43 b264)
    (on-table b264)
    (clear b309)
    (on b309 b333)
    (on b333 b207)
    (on b207 b299)
    (on b299 b330)
    (on-table b330)
    (clear b271)
    (on-table b271)
    (clear b367)
    (on b367 b295)
    (on b295 b267)
    (on b267 b197)
    (on b197 b162)
    (on b162 b85)
    (on b85 b40)
    (on b40 b359)
    (on b359 b210)
    (on b210 b29)
    (on-table b29)
    (clear b171)
    (on b171 b237)
    (on b237 b232)
    (on-table b232)
    (clear b79)
    (on b79 b352)
    (on b352 b395)
    (on b395 b196)
    (on b196 b41)
    (on b41 b72)
    (on b72 b176)
    (on b176 b240)
    (on b240 b136)
    (on-table b136)
    (clear b301)
    (on b301 b317)
    (on b317 b339)
    (on b339 b214)
    (on-table b214)
    (clear b101)
    (on b101 b315)
    (on b315 b331)
    (on-table b331)
    (clear b157)
    (on b157 b253)
    (on b253 b163)
    (on-table b163)
    (clear b250)
    (on-table b250)
    (clear b311)
    (on b311 b24)
    (on b24 b289)
    (on b289 b188)
    (on b188 b283)
    (on b283 b351)
    (on b351 b325)
    (on b325 b323)
    (on b323 b14)
    (on b14 b179)
    (on b179 b150)
    (on b150 b114)
    (on b114 b396)
    (on-table b396)
    (clear b15)
    (on b15 b322)
    (on b322 b304)
    (on b304 b52)
    (on b52 b111)
    (on-table b111)
    (clear b348)
    (on b348 b336)
    (on-table b336)
    (clear b26)
    (on-table b26)
    (clear b77)
    (on-table b77)
    (clear b137)
    (on-table b137)
    (clear b199)
    (on-table b199)
    (clear b129)
    (on b129 b109)
    (on b109 b107)
    (on b107 b392)
    (on-table b392)
    (clear b328)
    (on b328 b169)
    (on-table b169)
    (clear b280)
    (on-table b280)
    (clear b187)
    (on b187 b216)
    (on-table b216)
    (clear b108)
    (on b108 b153)
    (on b153 b341)
    (on-table b341)
    (clear b365)
    (on b365 b281)
    (on b281 b133)
    (on b133 b342)
    (on b342 b2)
    (on b2 b329)
    (on b329 b228)
    (on-table b228)
    (clear b123)
    (on b123 b350)
    (on b350 b353)
    (on b353 b115)
    (on b115 b81)
    (on b81 b305)
    (on b305 b89)
    (on b89 b178)
    (on b178 b31)
    (on b31 b27)
    (on b27 b244)
    (on b244 b276)
    (on b276 b219)
    (on-table b219)
    (clear b36)
    (on b36 b20)
    (on-table b20)
    (clear b229)
    (on b229 b308)
    (on-table b308)
    (clear b75)
    (on-table b75)
    (clear b213)
    (on-table b213)
    (clear b86)
    (on b86 b184)
    (on b184 b96)
    (on b96 b159)
    (on b159 b105)
    (on b105 b100)
    (on b100 b287)
    (on-table b287)
    (clear b125)
    (on b125 b362)
    (on b362 b263)
    (on b263 b291)
    (on b291 b377)
    (on-table b377)
    (clear b274)
    (on b274 b258)
    (on b258 b233)
    (on b233 b44)
    (on b44 b46)
    (on-table b46)
    (clear b98)
    (on b98 b50)
    (on b50 b183)
    (on b183 b254)
    (on b254 b102)
    (on-table b102)
    (clear b39)
    (on b39 b126)
    (on b126 b88)
    (on b88 b48)
    (on b48 b374)
    (on-table b374)
    (clear b69)
    (on b69 b106)
    (on-table b106)
    (clear b390)
    (on b390 b73)
    (on-table b73)
    (clear b160)
    (on b160 b38)
    (on b38 b141)
    (on b141 b312)
    (on-table b312)
    (clear b360)
    (on b360 b294)
    (on b294 b158)
    (on b158 b376)
    (on b376 b182)
    (on b182 b71)
    (on-table b71)
    (clear b63)
    (on b63 b28)
    (on b28 b134)
    (on-table b134)
    (clear b265)
    (on b265 b384)
    (on b384 b144)
    (on b144 b391)
    (on b391 b95)
    (on b95 b92)
    (on b92 b252)
    (on b252 b211)
    (on-table b211)
    (clear b91)
    (on-table b91)
    (clear b190)
    (on b190 b82)
    (on b82 b335)
    (on b335 b78)
    (on b78 b293)
    (on-table b293))
 (:goal  (and 
    (clear b10)
    (on-table b10)
    (clear b5)
    (on-table b5)
    (clear b1)
    (on b1 b11)
    (on-table b11)
    (clear b8)
    (on b8 b9)
    (on b9 b3)
    (on-table b3)
    (clear b6)
    (on-table b6)
    (clear b7)
    (on b7 b4)
    (on b4 b2)
    (on-table b2))))

; plan
1. (unstack b5 b378)
   deleted: (on b5 b378) (clear b5) (arm-empty)
   added: (holding b5) (clear b378)
   goals met: 3 of 17
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 17
3. (unstack b167 b113)
   deleted: (on b167 b113) (clear b167) (arm-empty)
   added: (holding b167) (clear b113)
   goals met: 5 of 17
4. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 5 of 17
5. (unstack b113 b373)
   deleted: (on b113 b373) (clear b113) (arm-empty)
   added: (holding b113) (clear b373)
   goals met: 5 of 17
6. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 5 of 17
7. (unstack b202 b223)
   deleted: (on b202 b223) (clear b202) (arm-empty)
   added: (holding b202) (clear b223)
   goals met: 5 of 17
8. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 5 of 17
9. (unstack b218 b3)
   deleted: (on b218 b3) (clear b218) (arm-empty)
   added: (holding b218) (clear b3)
   goals met: 5 of 17
10. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 5 of 17
11. (unstack b3 b277)
   deleted: (on b3 b277) (clear b3) (arm-empty)
   added: (holding b3) (clear b277)
   goals met: 5 of 17
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 17
13. (unstack b22 b7)
   deleted: (on b22 b7) (clear b22) (arm-empty)
   added: (holding b22) (clear b7)
   goals met: 7 of 17
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 7 of 17
15. (unstack b220 b68)
   deleted: (on b220 b68) (clear b220) (arm-empty)
   added: (holding b220) (clear b68)
   goals met: 7 of 17
16. (putdown b220)
   deleted: (holding b220)
   added: (clear b220) (arm-empty) (on-table b220)
   goals met: 7 of 17
17. (unstack b223 b4)
   deleted: (on b223 b4) (clear b223) (arm-empty)
   added: (holding b223) (clear b4)
   goals met: 7 of 17
18. (putdown b223)
   deleted: (holding b223)
   added: (clear b223) (arm-empty) (on-table b223)
   goals met: 7 of 17
19. (unstack b298 b278)
   deleted: (on b298 b278) (clear b298) (arm-empty)
   added: (holding b298) (clear b278)
   goals met: 7 of 17
20. (putdown b298)
   deleted: (holding b298)
   added: (clear b298) (arm-empty) (on-table b298)
   goals met: 7 of 17
21. (unstack b278 b9)
   deleted: (on b278 b9) (clear b278) (arm-empty)
   added: (holding b278) (clear b9)
   goals met: 7 of 17
22. (putdown b278)
   deleted: (holding b278)
   added: (clear b278) (arm-empty) (on-table b278)
   goals met: 7 of 17
23. (unstack b32 b261)
   deleted: (on b32 b261) (clear b32) (arm-empty)
   added: (holding b32) (clear b261)
   goals met: 7 of 17
24. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 7 of 17
25. (unstack b261 b13)
   deleted: (on b261 b13) (clear b261) (arm-empty)
   added: (holding b261) (clear b13)
   goals met: 7 of 17
26. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 7 of 17
27. (unstack b13 b8)
   deleted: (on b13 b8) (clear b13) (arm-empty)
   added: (holding b13) (clear b8)
   goals met: 8 of 17
28. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 8 of 17
29. (unstack b365 b281)
   deleted: (on b365 b281) (clear b365) (arm-empty)
   added: (holding b365) (clear b281)
   goals met: 8 of 17
30. (putdown b365)
   deleted: (holding b365)
   added: (clear b365) (arm-empty) (on-table b365)
   goals met: 8 of 17
31. (unstack b281 b133)
   deleted: (on b281 b133) (clear b281) (arm-empty)
   added: (holding b281) (clear b133)
   goals met: 8 of 17
32. (putdown b281)
   deleted: (holding b281)
   added: (clear b281) (arm-empty) (on-table b281)
   goals met: 8 of 17
33. (unstack b133 b342)
   deleted: (on b133 b342) (clear b133) (arm-empty)
   added: (holding b133) (clear b342)
   goals met: 8 of 17
34. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 8 of 17
35. (unstack b342 b2)
   deleted: (on b342 b2) (clear b342) (arm-empty)
   added: (holding b342) (clear b2)
   goals met: 8 of 17
36. (putdown b342)
   deleted: (holding b342)
   added: (clear b342) (arm-empty) (on-table b342)
   goals met: 8 of 17
37. (unstack b2 b329)
   deleted: (on b2 b329) (clear b2) (arm-empty)
   added: (holding b2) (clear b329)
   goals met: 8 of 17
38. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 9 of 17
39. (unstack b373 b292)
   deleted: (on b373 b292) (clear b373) (arm-empty)
   added: (holding b373) (clear b292)
   goals met: 9 of 17
40. (putdown b373)
   deleted: (holding b373)
   added: (clear b373) (arm-empty) (on-table b373)
   goals met: 9 of 17
41. (unstack b292 b361)
   deleted: (on b292 b361) (clear b292) (arm-empty)
   added: (holding b292) (clear b361)
   goals met: 9 of 17
42. (putdown b292)
   deleted: (holding b292)
   added: (clear b292) (arm-empty) (on-table b292)
   goals met: 9 of 17
43. (unstack b361 b151)
   deleted: (on b361 b151) (clear b361) (arm-empty)
   added: (holding b361) (clear b151)
   goals met: 9 of 17
44. (putdown b361)
   deleted: (holding b361)
   added: (clear b361) (arm-empty) (on-table b361)
   goals met: 9 of 17
45. (unstack b151 b127)
   deleted: (on b151 b127) (clear b151) (arm-empty)
   added: (holding b151) (clear b127)
   goals met: 9 of 17
46. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 9 of 17
47. (unstack b127 b203)
   deleted: (on b127 b203) (clear b127) (arm-empty)
   added: (holding b127) (clear b203)
   goals met: 9 of 17
48. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 9 of 17
49. (unstack b203 b10)
   deleted: (on b203 b10) (clear b203) (arm-empty)
   added: (holding b203) (clear b10)
   goals met: 10 of 17
50. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 10 of 17
51. (unstack b68 b116)
   deleted: (on b68 b116) (clear b68) (arm-empty)
   added: (holding b68) (clear b116)
   goals met: 10 of 17
52. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 10 of 17
53. (unstack b116 b11)
   deleted: (on b116 b11) (clear b116) (arm-empty)
   added: (holding b116) (clear b11)
   goals met: 10 of 17
54. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 10 of 17
55. (unstack b11 b173)
   deleted: (on b11 b173) (clear b11) (arm-empty)
   added: (holding b11) (clear b173)
   goals met: 10 of 17
56. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 11 of 17
57. (unstack b80 b34)
   deleted: (on b80 b34) (clear b80) (arm-empty)
   added: (holding b80) (clear b34)
   goals met: 11 of 17
58. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 11 of 17
59. (unstack b34 b97)
   deleted: (on b34 b97) (clear b34) (arm-empty)
   added: (holding b34) (clear b97)
   goals met: 11 of 17
60. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 11 of 17
61. (unstack b97 b1)
   deleted: (on b97 b1) (clear b97) (arm-empty)
   added: (holding b97) (clear b1)
   goals met: 12 of 17
62. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 12 of 17
63. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 12 of 17
64. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 13 of 17
65. (unstack b9 b132)
   deleted: (on b9 b132) (clear b9) (arm-empty)
   added: (holding b9) (clear b132)
   goals met: 13 of 17
66. (stack b9 b3)
   deleted: (clear b3) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b3)
   goals met: 14 of 17
67. (unstack b1 b251)
   deleted: (on b1 b251) (clear b1) (arm-empty)
   added: (holding b1) (clear b251)
   goals met: 13 of 17
68. (stack b1 b11)
   deleted: (clear b11) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b11)
   goals met: 15 of 17
69. (unstack b7 b177)
   deleted: (on b7 b177) (clear b7) (arm-empty)
   added: (holding b7) (clear b177)
   goals met: 14 of 17
70. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 16 of 17
71. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 15 of 17
72. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 17 of 17
